---
kind: other
id: Properties.T:Autodesk.Revit.DB.PartMaker
source: html/f8507df9-f678-c4a6-7e77-d777707fe9cf.htm
---
# PartMaker Properties

The id of the assembly instance to which the element belongs.